In [1]:
library("tidyverse")

Warning message:
“package ‘lubridate’ was built under R version 4.4.2”
── Attaching core tidyverse packages ──────────────────────── tidyverse 2.0.0 ──
✔ dplyr     1.1.4     ✔ readr     2.1.5
✔ forcats   1.0.0     ✔ stringr   1.5.1
✔ ggplot2   3.5.1     ✔ tibble    3.2.1
✔ lubridate 1.9.4     ✔ tidyr     1.3.1
✔ purrr     1.0.2
── Conflicts ────────────────────────────────────────── tidyverse_conflicts() ──
✖ dplyr::filter() masks stats::filter()
✖ dplyr::lag()    masks stats::lag()
ℹ Use the conflicted package (<http://conflicted.r-lib.org/>) to force all conflicts to become errors

<h1>Quick R Review for 482</h1>
<h3>Alan Lee</h3>
This contains a list of basic R data analysis skills i put together to help give my POLI 482 peers get a crash course in using R w/ Dplyr. The is based on my notes from DSCI 100, POLI 381, and Stat 301.<br>
The images are generated from ChatGPT

<h2>Table of Contents</h2>

1. Reading Data

2. Basic Cleaning (Select/Filter/Mutate/Group by/Summarize)

3. Merging Data

4. Pivoting Long/Wide

<img src="img/wizard_cartoon.png" alt="Drawing" style="width: 350px;"/>
<h4>"Hi Everyone! I need your help doing some basic data analysis. I can show you some R code but I will need you in the real world to run it."</h4>

<h2>Reading Data</h2>

<h3>Locally:</h3> 

* Relative Path
    * Start from current working folder
    * Eg. `read_csv("downloads/folder_with_example_data/example.csv")`

* Absolute Path
    * Start with / and give exactly where the file location is
    * Eg. `read_csv("C:Users/username/downloads/folder_with_example_data/example.csv")`
    * read_csv also works direct from url

Use `getwd()` to find what your current working directory is

Use `setwd()` to set your current working directory

<h3>Load the Dataset</h3>

* `read_csv("...")`

  
(Note: read_csv is a dplyr version of base read.csv. It is faster and doesn't convert character variables to factors like base read.csv)

* `read_excel("...")`
  
* `read_delim(file = "...", delim = "...", skip = ..., col_names = TRUE)`

<h3>Example:</h3>

```{r}
read_delim("...", # the dataset
           delim = "...", # how the data is seperated eg. "," or ";" or " " or etc
           skip = ..., # shows how many lines to skip. Eg. if the file starts with lines of metadata like Created By UBC ...
           col_names = TRUE) # True if file has headers false if no headers
```

<h3>Other file types</h3>

Stata and SPSS files use haven package:

* `install.packages("haven")`
* `read_dta("...")`

* `read_spss(...)`

Dplyr which is part of tidyverse can already unzip .gz files:
  
* `read_csv("file.csv.gz")`

<h2> Exploring Data</h2>

Other useful things: 

* `is.na(col_name)`
    * returns true if a value is NA and checks each value in a vector
    * `!is.na()` checks if there is a non NA value. Returns true if there is non NA data
<br/><br/>

* `unique(col_name)`
    * gives unique values in a column
<br/><br/>
* `colnames(data_frame)`
* `rownames(data_frame)`
    * gives column/row names of a dataframe
<br/><br/>
* `slice(n, m, ...)`
    * gets part of the dataframe
    * df %>% slice(3:6)  # Selects rows from 3 to 6
    * df %>% slice(3,5,6)  # Selects rows 3, 5 and 6
<br/><br/>
* `arrange(data_frame, col_name)`
* `arrange(data_frame, desc(col_name))`
    * arranges the dataframe by the col_name in ascending order. user dec(col_name) for descending 
<br/><br/>
* `nrow(data_frame)`
* `ncol(data_frame)`
* `dim(data_frame)`
    * gives # of rows or columns or dimensions of a dataframe

<h2>Example</h2>

In [17]:
# uncomment and replace ... to get first 10 rows of mtcars data
# slice(mtcars, ...:...)

In [50]:
slice(mtcars, 1:10)

                  mpg  cyl disp  hp  drat wt    qsec  vs am gear carb
Mazda RX4         21.0 6   160.0 110 3.90 2.620 16.46 0  1  4    4
Mazda RX4 Wag     21.0 6   160.0 110 3.90 2.875 17.02 0  1  4    4
Datsun 710        22.8 4   108.0  93 3.85 2.320 18.61 1  1  4    1
Hornet 4 Drive    21.4 6   258.0 110 3.08 3.215 19.44 1  0  3    1
Hornet Sportabout 18.7 8   360.0 175 3.15 3.440 17.02 0  0  3    2
Valiant           18.1 6   225.0 105 2.76 3.460 20.22 1  0  3    1
Duster 360        14.3 8   360.0 245 3.21 3.570 15.84 0  0  3    4
Merc 240D         24.4 4   146.7  62 3.69 3.190 20.00 1  0  4    2
Merc 230          22.8 4   140.8  95 3.92 3.150 22.90 1  0  4    2
Merc 280          19.2 6   167.6 123 3.92 3.440 18.30 1  0  4    4

In [18]:
# what are the dimensions of mtcars?
#uncomment and replace ... 
# ...(mtcars)
# what are the column names?
#...(mtcars)

In [19]:
# What are the different types of engines in the data? (eg. 4 cylinder, 6 cylinder) 
# uncomment and replace ...
#...(mtcars$...)

# What are all teh different types of cars in the dataset?
#...(...)

<H2>2. Basic Cleaning</H2>

Tidy Data:
* each column is a single variable
* each row is a single case/observation
* each cell is a single value (e.g. not [David 200 "Sales Dept"])

Below will use the pipe operator `|>`: <br> This lets you chain operations into an easy to read format. It assumes the results of the previous operation become the 1st argument of the next function.

In [3]:
# Make a radom fake dataset:
set.seed(1234) # so we always make the same random numbers

fake_country_data <- tibble(country_id = 1:6,
                       country_code = LETTERS[1:6],
                       gdp = rnorm(6, mean = 50000000, sd = 100000), # make 6 random gdp
                       pop = rnorm(6, mean = 1000000, sd = 50000), # make 6 random populations
                       alliance = rep(LETTERS [7:9], length.out = 6), # assign E,F,G as alliance to 6 rows
                       democratic = sample(rep(c(TRUE, FALSE), each = 3)), # assign democratic = TRUE to 3 countries
                
                      ) 
fake_country_data

  country_id country_code gdp      pop      alliance democratic
1 1          A            49879293 971263.0 G        FALSE
2 2          B            50027743 972668.4 H        FALSE
3 3          C            50108444 971777.4 I         TRUE
4 4          D            49765430 955498.1 G         TRUE
5 5          E            50042912 976140.4 H         TRUE
6 6          F            50050606 950080.7 I        FALSE

<h3>Piping mutate, filter, select</h3> 
Let's try some chaining some mutate, filters, and selections:

```{r}
new_dataset <- dataset_source |>
	mutate(new_column = column1 * column2) |>
	filter(another_column > X) |>
	select(new_column)
```
This would take the dataset_source,  **AND THEN** <br> 
mutate it so you create a new_column made of column1 * column2,  **AND THEN**<br> 
filter out any rows where another colunm has a value > X,  **AND THEN** <br>
select the new column we made to make new_dataset

<h2>Example</h2>
Try using fake_country_data and creating:

1. a column named gdp_per_capita
2. filtering for gdp_per_capita > average and democratic == False
4. selecting the country_code, gdp_per_capita, and alliance

In [4]:
# uncomment and replace ...
# subset_data <- ... |>
#     mutate(... = ... ... ...) |>
#     ...(... > mean(...) |>
#     select(... , ... , ...)

# subset_data

In [5]:
# my answer
subset_data <- fake_country_data |>
    mutate(gdp_per_capita = gdp / pop) |>
    filter(gdp_per_capita > mean(gdp_per_capita)) |>
    select(country_code , gdp_per_capita , alliance)

subset_data

  country_code gdp_per_capita alliance
1 D            52.08323       G
2 F            52.68037       I

You can use many other operators in filter (eg.>=, <=, ==, !=) or filter for multiple columns at once.

<h2>Group by, summarize, n </h2>
Let's try some chaining some mutate, filters, and selections

```{r}
new_dataset <- dataset_source |>
    group_by(some_column) |>                 # group by the values in some column(s)
    summarize (mean = mean(another column),  # create a new column that summarizes something
                n = n()
    )
```



Let's find the average gdp of democracies and non democracies and how many are in that dataset

In [7]:
# uncomment and replace ...
# group_data <- ... |>
#     group_by(...) |>
#     summarize(... = ...(...),
#              n = n())

# group_data

In [8]:
# sample answer
group_data <- fake_country_data |>
    group_by(democratic) |>
    summarize(mean = mean(gdp),
             n = n())

group_data

  democratic mean     n
1 FALSE      49985881 3
2  TRUE      49972262 3

You can make your own funtions or use many other functions in summarize. Play around with other functions.

<h2>3. Merging Data</h2>

In [9]:
#generate some fake data to merge

df1 <- tibble(city_id = c(1, 2, 3, 4),
                  city = c("Amsterdam", "Bangkok", "Chongqing", "Delhi"),
                  votes = c(25, 30, 35, 40))

df2 <- data.frame(city_id = c(3, 4, 5, 6),
                  cost = c(590, 285, 480, 725))

Try to fill in the ... to merge the ticket cost to the city:

In [10]:
# uncomment the code and fill in the ...
# merged_data <- ..._join(..., ..., by = ...)
# merged_data

In [11]:
#create a df2 with a different id column name
df3 <- data.frame(ticket_id = c(3, 4, 5, 6),
                  cost = c(590, 285, 480, 725))

# Inner join matches from both dataframes:
inner_join_data <- inner_join(df1, df3, by = c("city_id" = "ticket_id"))

inner_join_data

# Left join (combine df2 to df1 if there is a match in df1)
left_join_data <- left_join(df1, df3, by = c("city_id" = "ticket_id"))

left_join_data

# Right join (combine df1 to df2 if there is a match in df2)
right_join_data <-right_join(df1, df3, by = c("city_id" = "ticket_id"))

right_join_data

# Full join (combine all rows. if no match just append)
full_join_data <- full_join(df1, df3, by = c("city_id" = "ticket_id"))

full_join_data

  city_id city      votes cost
1 3       Chongqing 35    590
2 4       Delhi     40    285

  city_id city      votes cost
1 1       Amsterdam 25     NA
2 2       Bangkok   30     NA
3 3       Chongqing 35    590
4 4       Delhi     40    285

  city_id city      votes cost
1 3       Chongqing 35    590
2 4       Delhi     40    285
3 5       NA        NA    480
4 6       NA        NA    725

  city_id city      votes cost
1 1       Amsterdam 25     NA
2 2       Bangkok   30     NA
3 3       Chongqing 35    590
4 4       Delhi     40    285
5 5       NA        NA    480
6 6       NA        NA    725

<h2>4. Pivot Data</h2>
Sometimes Data is recorded in a wide format because it is easier for humans to work with that way. We might find it easier to work with data in a long format. Let's try moving between the two.

In [12]:
#generate a fake sales data set
years <- 2000:2010
months <- month.name

set.seed(1234)  # so your random number generators are based on the same seed and makes the same random set
sales_data <- tibble(year = years)
for (month in months) {
  sales_data[[month]] <- sample(1:100, length(years), replace = TRUE)
}
head(sales_data)

  year January February March April May June July August September October
1 2000 28      70        56     3   49  17   10   41     60         6
2 2001 80      79        67    87   56  63   55   63     65        85
3 2002 22      78       100    41   51   8   22   71     36        85
4 2003  9      14        95   100    6  96   25   61     28        32
5 2004  5      56        93    72   49  22    3   96     19        77
6 2005 38      62         5    32   93  35   83   51      9        17
  November December
1  80      43
2  11      19
3  60      22
4 100      46
5  35      40
6  90      29

In [14]:
#Make your own long data:
# uncomment and replace
# long_sales_data <- ... |> # takes a data frame
#        pivot_longer(cols = # choose which columns to pivot, the names of these columns becomne a value in a new column you create
#                     names_to = "...", # what will the name of this new column you create be?
#                     values_to = "...") # what will the names of those column's values be?

# head(long_sales_data) # view the top 5
# tail(long_sales_data) # view the bot 5

In [15]:
#Sample:

long_sales_data <- sales_data |>
       pivot_longer(cols = -year,
                    names_to = "month",
                    values_to = "units_sold") 

head(long_sales_data)
tail(long_sales_data)

  year month    units_sold
1 2000 January  28
2 2000 February 70
3 2000 March    56
4 2000 April     3
5 2000 May      49
6 2000 June     17

  year month     units_sold
1 2010 July      20
2 2010 August    48
3 2010 September 58
4 2010 October   53
5 2010 November   9
6 2010 December  88

In [16]:
# Change it back to wide data:

wide_sales_data <- long_sales_data |> 
    pivot_wider(names_from = "month",
                values_from = "units_sold")

head(wide_sales_data)

  year January February March April May June July August September October
1 2000 28      70        56     3   49  17   10   41     60         6
2 2001 80      79        67    87   56  63   55   63     65        85
3 2002 22      78       100    41   51   8   22   71     36        85
4 2003  9      14        95   100    6  96   25   61     28        32
5 2004  5      56        93    72   49  22    3   96     19        77
6 2005 38      62         5    32   93  35   83   51      9        17
  November December
1  80      43
2  11      19
3  60      22
4 100      46
5  35      40
6  90      29

<h2>STRING R and REGEX... another day?</h2>

<h1>Thanks for your time everyone</h1>



<img src="img/wizard_cartoon_bye.png" alt="Drawing" style="width: 350px;"/>
<h4>

"Thanks for your help everyone. It looks like I have to run. Until next time!"</h4>